In [2]:
import pandas as pd
import numpy as np

In [3]:
e=pd.Series()

/tmp/ipykernel_1519/2339862220.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  e=pd.Series()

In [4]:
type(e)

pandas.core.series.Series

In [5]:
df=pd.Series(['s','f',3,4])
df

0    s
1    f
2    3
3    4
dtype: object

In [6]:
type(df)

pandas.core.series.Series

In [7]:
l=["apple","banana","orange"]
s=pd.Series(l)
s

0     apple
1    banana
2    orange
dtype: object

In [8]:
type(s)

pandas.core.series.Series

In [9]:
s1=pd.Series(l,index=['a','b','c'])
s1

a     apple
b    banana
c    orange
dtype: object

In [10]:
a=np.array([1,2,3,4,5,6])
df1=pd.Series(a)
df1

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [11]:
d={'a':1,'b':2,'c':3}
d

{'a': 1, 'b': 2, 'c': 3}

In [12]:
df2=pd.Series(d)
d

{'a': 1, 'b': 2, 'c': 3}

In [13]:
t=[('a', 1), ('b', 2), ('c', 3)]
t

[('a', 1), ('b', 2), ('c', 3)]

In [14]:
df3=pd.Series(t)
df3

0    (a, 1)
1    (b, 2)
2    (c, 3)
dtype: object

In [15]:
students={
    "Name": ["Hari","dsds","sdsds"],
    "occupation" :["Biologist","Student","Student"],
    "age": [25,20,18]
}
students

{'Name': ['Hari', 'dsds', 'sdsds'],
 'occupation': ['Biologist', 'Student', 'Student'],
 'age': [25, 20, 18]}

In [16]:
df4=pd.Series(students)
df4

Name                    [Hari, dsds, sdsds]
occupation    [Biologist, Student, Student]
age                            [25, 20, 18]
dtype: object

In [17]:
df4[0][0]

'Hari'

In [18]:
df5=pd.DataFrame(students)
df5

    Name occupation  age
0   Hari  Biologist   25
1   dsds    Student   20
2  sdsds    Student   18

In [19]:
ind=['p1','p2','p3']
col=['Name','Occupation','Age']

In [20]:
col

['Name', 'Occupation', 'Age']

In [21]:
df6 = pd.DataFrame(data=students,index=ind,columns=col)
df6

     Name Occupation  Age
p1   Hari        NaN  NaN
p2   dsds        NaN  NaN
p3  sdsds        NaN  NaN

In [22]:
df6 = pd.DataFrame.from_dict(students,orient='index',columns=ind)
df6.T

     Name occupation age
p1   Hari  Biologist  25
p2   dsds    Student  20
p3  sdsds    Student  18

In [23]:
df=pd.read_csv("/config/workspace/data/titanic.csv")
df.head()

,Id,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0

In [24]:
df.shape

(891, 12)

In [25]:
df.columns

Index(['Id', 'Pclass', 'Name', 'Gender', 'Age', 'SibSp', 'Parch', 'Ticket',
       'Fare', 'Cabin', 'Embarked', 'Survived'],
      dtype='object')

In [26]:
df['Pclass']

0      3
1      1
2      3
3      1
4      3
      ..
886    2
887    1
888    3
889    1
890    3
Name: Pclass, Length: 891, dtype: int64

In [27]:
df['Pclass'].head()

0    3
1    1
2    3
3    1
4    3
Name: Pclass, dtype: int64

In [28]:
df[['Name','Gender']]

                                                  Name  Gender
0                              Braund, Mr. Owen Harris    male
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female
2                               Heikkinen, Miss. Laina  female
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female
4                             Allen, Mr. William Henry    male
..                                                 ...     ...
886                              Montvila, Rev. Juozas    male
887                       Graham, Miss. Margaret Edith  female
888           Johnston, Miss. Catherine Helen "Carrie"  female
889                              Behr, Mr. Karl Howell    male
890                                Dooley, Mr. Patrick    male

[891 rows x 2 columns]

In [29]:
df[['Pclass','Gender']]

     Pclass  Gender
0         3    male
1         1  female
2         3  female
3         1  female
4         3    male
..      ...     ...
886       2    male
887       1  female
888       3  female
889       1    male
890       3    male

[891 rows x 2 columns]

In [30]:
df[['Name','Gender','Pclass']]

                                                  Name  Gender  Pclass
0                              Braund, Mr. Owen Harris    male       3
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female       1
2                               Heikkinen, Miss. Laina  female       3
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female       1
4                             Allen, Mr. William Henry    male       3
..                                                 ...     ...     ...
886                              Montvila, Rev. Juozas    male       2
887                       Graham, Miss. Margaret Edith  female       1
888           Johnston, Miss. Catherine Helen "Carrie"  female       3
889                              Behr, Mr. Karl Howell    male       1
890                                Dooley, Mr. Patrick    male       3

[891 rows x 3 columns]

In [31]:
col_range=list(range(5))
col_range

[0, 1, 2, 3, 4]

In [32]:
df1=df.iloc[:,0:5]
df1

,Id,Pclass,Name,Gender,Age
0,1,3,"Braund, Mr. Owen Harris",male,22.0
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0
2,3,3,"Heikkinen, Miss. Laina",female,26.0
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0
4,5,3,"Allen, Mr. William Henry",male,35.0
...,...,...,...,...,...
886,887,2,"Montvila, Rev. Juozas",male,27.0
887,888,1,"Graham, Miss. Margaret Edith",female,19.0
888,889,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN
889,890,1,"Behr, Mr. Karl Howell",male,26.0
890,891,3,"Dooley, Mr. Patrick",male,32.0

In [33]:
df1.iloc[:,3:5]

     Gender   Age
0      male  22.0
1    female  38.0
2    female  26.0
3    female  35.0
4      male  35.0
..      ...   ...
886    male  27.0
887  female  19.0
888  female   NaN
889    male  26.0
890    male  32.0

[891 rows x 2 columns]

In [34]:
df.iloc[:,[1,2,5,6]]

     Pclass                                               Name  SibSp  Parch
0         3                            Braund, Mr. Owen Harris      1      0
1         1  Cumings, Mrs. John Bradley (Florence Briggs Th...      1      0
2         3                             Heikkinen, Miss. Laina      0      0
3         1       Futrelle, Mrs. Jacques Heath (Lily May Peel)      1      0
4         3                           Allen, Mr. William Henry      0      0
..      ...                                                ...    ...    ...
886       2                              Montvila, Rev. Juozas      0      0
887       1                       Graham, Miss. Margaret Edith      0      0
888       3           Johnston, Miss. Catherine Helen "Carrie"      1      2
889       1                              Behr, Mr. Karl Howell      0      0
890       3                                Dooley, Mr. Patrick      0      0

[891 rows x 4 columns]

In [35]:
df.loc[:]

,Id,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0
887,888,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,1
888,889,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,0
889,890,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,1
890,891,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0

In [36]:
df.loc[:,['Pclass','Ticket']]

     Pclass            Ticket
0         3         A/5 21171
1         1          PC 17599
2         3  STON/O2. 3101282
3         1            113803
4         3            373450
..      ...               ...
886       2            211536
887       1            112053
888       3        W./C. 6607
889       1            111369
890       3            370376

[891 rows x 2 columns]

In [37]:
df.loc[:,['Pclass','Gender','Ticket']]

     Pclass  Gender            Ticket
0         3    male         A/5 21171
1         1  female          PC 17599
2         3  female  STON/O2. 3101282
3         1  female            113803
4         3    male            373450
..      ...     ...               ...
886       2    male            211536
887       1  female            112053
888       3  female        W./C. 6607
889       1    male            111369
890       3    male            370376

[891 rows x 3 columns]

In [38]:
df.head(1)

,Id,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S,0

In [39]:
df.loc[:,"Name":"Fare"]

,Name,Gender,Age,SibSp,Parch,Ticket,Fare
0,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833
2,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000
4,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500
...,...,...,...,...,...,...,...
886,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000
887,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000
888,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500
889,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000
890,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500

In [40]:
df.groupby("Pclass")["Fare"].mean()

Pclass
1    84.154687
2    20.662183
3    13.675550
Name: Fare, dtype: float64

In [41]:
df.groupby("Age")["Fare"].mean()

Age
0.42       8.5167
0.67      14.5000
0.75      19.2583
0.83      23.8750
0.92     151.5500
           ...
70.00     40.7500
70.50      7.7500
71.00     42.0792
74.00      7.7750
80.00     30.0000
Name: Fare, Length: 88, dtype: float64

In [42]:
df.Gender.value_counts()

male      577
female    314
Name: Gender, dtype: int64

In [43]:
df["Age"].value_counts()

24.00    30
22.00    27
18.00    26
19.00    25
28.00    25
         ..
36.50     1
55.50     1
0.92      1
23.50     1
74.00     1
Name: Age, Length: 88, dtype: int64

In [44]:
type(df["Age"].values)

numpy.ndarray

In [45]:
type(df["Gender"].values)

numpy.ndarray

In [46]:
type(df["Gender"].value_counts())

pandas.core.series.Series

In [47]:
df.columns

Index(['Id', 'Pclass', 'Name', 'Gender', 'Age', 'SibSp', 'Parch', 'Ticket',
       'Fare', 'Cabin', 'Embarked', 'Survived'],
      dtype='object')

In [48]:
df.groupby(['Gender','Pclass'])['Fare'].mean()

Gender  Pclass
female  1         106.125798
        2          21.970121
        3          16.118810
male    1          67.226127
        2          19.741782
        3          12.661633
Name: Fare, dtype: float64

In [50]:
df.groupby(['Gender','Pclass'])[['Fare','Age']].mean()

                     Fare        Age
Gender Pclass
female 1       106.125798  34.611765
       2        21.970121  28.722973
       3        16.118810  21.750000
male   1        67.226127  41.281386
       2        19.741782  30.740707
       3        12.661633  26.507589

In [51]:
result= df.groupby(['Gender','Pclass'])[['Fare','Age']].mean()
result

                     Fare        Age
Gender Pclass
female 1       106.125798  34.611765
       2        21.970121  28.722973
       3        16.118810  21.750000
male   1        67.226127  41.281386
       2        19.741782  30.740707
       3        12.661633  26.507589

In [52]:
result.reset_index()

   Gender  Pclass        Fare        Age
0  female       1  106.125798  34.611765
1  female       2   21.970121  28.722973
2  female       3   16.118810  21.750000
3    male       1   67.226127  41.281386
4    male       2   19.741782  30.740707
5    male       3   12.661633  26.507589

In [54]:
df['Gender'].value_counts()

male      577
female    314
Name: Gender, dtype: int64

In [55]:
#df['Gender','Pclass'].value_counts()

KeyError: ('Gender', 'Pclass')

In [57]:
df.groupby('Gender')['Pclass'].value_counts()

Gender  Pclass
female  3         144
        1          94
        2          76
male    3         347
        1         122
        2         108
Name: Pclass, dtype: int64

In [58]:
res= df.groupby('Gender')['Pclass'].value_counts()
res

Gender  Pclass
female  3         144
        1          94
        2          76
male    3         347
        1         122
        2         108
Name: Pclass, dtype: int64

In [59]:
#res.reset_index()

ValueError: cannot insert Pclass, already exists

In [60]:
df['Gender'].nunique()

2

In [61]:
df['Pclass'].nunique()

3

In [62]:
df.groupby('Pclass')['Gender'].nunique()

Pclass
1    2
2    2
3    2
Name: Gender, dtype: int64

In [67]:
df=pd.read_csv('/config/workspace/data/index.csv')
df

     Unnamed: 0  age  salary
0             1   91    6645
1             2   96    4488
2             3   22    9759
3             4   55    8930
4             5   70    9183
..          ...  ...     ...
195         196   97    2283
196         197   96    9563
197         198   99    4944
198         199   29    7421
199         200   36    9456

[200 rows x 3 columns]

In [68]:
df=pd.read_csv('/config/workspace/data/index.csv',index_col=0)
df

     age  salary
1     91    6645
2     96    4488
3     22    9759
4     55    8930
5     70    9183
..   ...     ...
196   97    2283
197   96    9563
198   99    4944
199   29    7421
200   36    9456

[200 rows x 2 columns]

In [77]:
df=pd.read_csv("/config/workspace/data/titanic.csv")
#df=pd.read_csv("/config/workspace/data/titanic.csv", engine='pyarrow', dtype_backend='pyarrow')
df.head()

,Id,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0

In [78]:
df.isna().sum()

Id            0
Pclass        0
Name          0
Gender        0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       687
Embarked      2
Survived      0
dtype: int64

In [79]:
df.index

RangeIndex(start=0, stop=891, step=1)

In [80]:
df

,Id,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,0
887,888,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,1
888,889,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,0
889,890,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,1
890,891,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0

In [81]:
df.index[889]

889

In [82]:
df.iloc[889]

Id                            890
Pclass                          1
Name        Behr, Mr. Karl Howell
Gender                       male
Age                          26.0
SibSp                           0
Parch                           0
Ticket                     111369
Fare                         30.0
Cabin                        C148
Embarked                        C
Survived                        1
Name: 889, dtype: object

In [83]:
df.columns

Index(['Id', 'Pclass', 'Name', 'Gender', 'Age', 'SibSp', 'Parch', 'Ticket',
       'Fare', 'Cabin', 'Embarked', 'Survived'],
      dtype='object')

In [85]:
df.keys()

Index(['Id', 'Pclass', 'Name', 'Gender', 'Age', 'SibSp', 'Parch', 'Ticket',
       'Fare', 'Cabin', 'Embarked', 'Survived'],
      dtype='object')

In [88]:
df.values

array([[1, 3, 'Braund, Mr. Owen Harris', ..., nan, 'S', 0],
       [2, 1, 'Cumings, Mrs. John Bradley (Florence Briggs Thayer)', ...,
        'C85', 'C', 1],
       [3, 3, 'Heikkinen, Miss. Laina', ..., nan, 'S', 1],
       ...,
       [889, 3, 'Johnston, Miss. Catherine Helen "Carrie"', ..., nan,
        'S', 0],
       [890, 1, 'Behr, Mr. Karl Howell', ..., 'C148', 'C', 1],
       [891, 3, 'Dooley, Mr. Patrick', ..., nan, 'Q', 0]], dtype=object)

In [90]:
df[df['Age'] >df['Age'].mean()]

,Id,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0
6,7,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S,0
11,12,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S,1
...,...,...,...,...,...,...,...,...,...,...,...,...
873,874,3,"Vander Cruyssen, Mr. Victor",male,47.0,0,0,345765,9.0000,NaN,S,0
879,880,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C,1
881,882,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S,0
885,886,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q,0
890,891,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,0

In [96]:
df[df['Age'] >df['Age'].mean()].value_counts()

Id   Pclass  Name                                                 Gender  Age   SibSp  Parch  Ticket         Fare      Cabin  Embarked  Survived
2    1       Cumings, Mrs. John Bradley (Florence Briggs Thayer)  female  38.0  1      0      PC 17599       71.2833   C85    C         1           1
578  1       Silvey, Mrs. William Baird (Alice Munger)            female  39.0  1      0      13507          55.9000   E44    S         1           1
648  1       Simonius-Blumer, Col. Oberst Alfons                  male    56.0  0      0      13213          35.5000   A26    C         1           1
646  1       Harper, Mr. Henry Sleeper                            male    48.0  1      0      PC 17572       76.7292   D33    C         1           1
633  1       Stahelin-Maeglin, Dr. Max                            male    32.0  0      0      13214          30.5000   B50    C         1           1
                                                                                                                                                   ..
293  2       Levy, Mr. Rene Jacques                               male    36.0  0      0      SC/Paris 2163  12.8750   D      C         0           1
276  1       Andrews, Miss. Kornelia Theodosia                    female  63.0  1      0      13502          77.9583   D7     S         1           1
274  1       Natsch, Mr. Charles H                                male    37.0  0      1      PC 17596       29.7000   C118   C         0           1
270  1       Bissette, Miss. Amelia                               female  35.0  0      0      PC 17760       135.6333  C99    S         1           1
880  1       Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)        female  56.0  0      1      11767          83.1583   C50    C         1           1
Length: 118, dtype: int64